//=============================================================================
//
// イベント処理 [event.cpp]
// Author : 藤田高輔
//
//=============================================================================

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "game.h"
#include "oneweek.h"
#include "input.h"
#include "event.h"
#include "debugproc.h"
#include "rival.h"

#include "bg.h"

#include "text.h"

#include "file data.h"

#include "weekresult.h"
#include "text box.h"
/******************************************************************************
* マクロ定義
******************************************************************************/

/******************************************************************************
* プロトタイプ宣言
******************************************************************************/

/******************************************************************************
* グローバル変数
******************************************************************************/
EVENT g_event;		//グローバル変数（複数作成必要なし)

/******************************************************************************
* 初期化処理
******************************************************************************/
void InitEvent(void)
{
	//ポインタ取得
	EVENT* event = GetEvent();

	return;
}
/******************************************************************************
* 終了処理
******************************************************************************/
void UninitEvent(void)
{

}
/******************************************************************************
* 更新関数
******************************************************************************/
void UpdateEvent(void)
{
	//ポインタ取得
	EVENT* event = GetEvent();
	WEEKLOOP* weekloop = GetWeeekloop();

	//ページ送り
	if (GetKeyboardTrigger(DIK_SPACE))
	{
		AdvanceText();
	}

	if (GetKeyboardTrigger(DIK_1))
	{
		SetWeekresult(RIVAL_01);
	}
	if (GetKeyboardTrigger(DIK_2))
	{
		SetWeekresult(RIVAL_02);
	}
	if (GetKeyboardTrigger(DIK_3))
	{
		SetWeekresult(RIVAL_03);
	}

}

/******************************************************************************
* 描画関数
******************************************************************************/
void DrawEvent(void)
{

}

/******************************************************************************
* 描画関数
******************************************************************************/
EVENT* GetEvent(void)
{
	return &g_event;
}

//=============================================================================
// イベントへ移動
void SetEventScene(int target)
{
	//ポインタ取得
	RIVAL *rival = GetRival(0);
	WEEKLOOP *week = GetWeeekloop();

	week->status = WEEKLOOP_EVENT;

	SetBgTextureIdx(BG_IDX_OUTSIDE);

	SetTextBoxPress(Idx_PRESS_SPACE);

	for (int i = 0; i < RIVAL_MAX; i++)
		(rival + i)->use = false;

	(rival + target)->use = true;
	LoadOptionText();	// オプションオンのテキストをバッファーに書き込む


}
