//=============================================================================
//
// ファイルデータの処理 [file data.h]
// Author : 川井
//
//=============================================================================
#ifndef _FILE_DATA_H_
#define _FILE_DATA_H_

#include "main.h"


//=============================================================================
// マクロ定義



//=============================================================================
// 構造体宣言


//=============================================================================
// プロトタイプ宣言
void OpenEventFile(int week);
void LoadDayStartText(void);
void LoadTargetSelectText(int Idx);
void LoadOptionText(void);
void LoadResultText(int Idx);

#endif