//=============================================================================
//
// プレイヤーの処理 [player.cpp]
// Author : 藤田高輔
//=============================================================================
#include "main.h"
#include "player.h"

//=============================================================================
// マクロ定義

//=============================================================================
// プロトタイプ宣言

//=============================================================================
// グローバル変数
PLAYER g_player[PLAYER_MAX];
LPDIRECT3DTEXTURE9		g_pD3DTexturePlayer[PLAYER_MAX];		// テクスチャへのポインタ

//=============================================================================
// プレイヤーモードの初期化処理
void InitPlayer(int oldMode)
{
	//デバイス取得
	LPDIRECT3DDEVICE9 pDevice = GetDevice();
	//playerの先頭アドレス取得
	PLAYER *player = GetPlayer();



}

//=============================================================================
// プレイヤーモードの初期化処理
void UninitPlayer(int mode)
{
}

//=============================================================================
// プレイヤーモードの最新処理
void UpdatePlayer(void)
{



}

//=============================================================================
// プレイヤーモードの描画処理
void DrawPlayer(void)
{

}

//=============================================================================
// プレイヤー取得関数
PLAYER *GetPlayer(void)
{
	return &g_player[0];
}