//=============================================================================
//
// ターゲットの処理 [terget.cpp]
// Author : 藤田高輔
//=============================================================================
#include "main.h"
#include "terget.h"

//=============================================================================
// マクロ定義

//=============================================================================
// プロトタイプ宣言

//=============================================================================
// グローバル変数
TERGET *g_terget[TERGET_MAX];
LPDIRECT3DTEXTURE9		g_pD3DTextureTerget[TERGET_MAX];		// テクスチャへのポインタ

//=============================================================================
// ターゲットモードの初期化処理
void InitTerget(void)
{
	//デバイス取得
	LPDIRECT3DDEVICE9 pDevice = GetDevice();
	//tergetの先頭アドレス取得
	TERGET *terget = GetTerget();

}

//=============================================================================
// ターゲットモードの初期化処理
void UninitTerget(void)
{
}

//=============================================================================
// ターゲットモードの最新処理
void UpdateTerget(void)
{



}

//=============================================================================
// ターゲットモードの描画処理
void DrawTerget(void)
{

}

//=============================================================================
// ターゲット取得関数
TERGET *GetTerget(void)
{
	return g_terget[0];
}